attic/qa/apps/qa-regress/axis/servicesAndPorts/noPound.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<!--

  Licensed to the Apache Software Foundation (ASF) under one or more
  contributor license agreements.  See the NOTICE file distributed with
  this work for additional information regarding copyright ownership.
  The ASF licenses this file to You under the Apache License, Version 2.0
  (the "License"); you may not use this file except in compliance with
  the License.  You may obtain a copy of the License at

      http://www.apache.org/licenses/LICENSE-2.0

  Unless required by applicable law or agreed to in writing, software
  distributed under the License is distributed on an "AS IS" BASIS,
  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  See the License for the specific language governing permissions and
  limitations under the License.

-->
<definitions
    targetNamespace="http://soapinterop.org/"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:http="http://schemas.xmlsoap.org/wsdl/http/"
    xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/"
    xmlns:s="http://www.w3.org/2001/XMLSchema"
    xmlns:s0="http://soapinterop.org/xsd"
    xmlns:s1="http://soapinterop.org/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/">
    <types> </types>
    <message name="echoStringSoapIn">
        <part name="inputString" type="s:string"/>
    </message>
    <message name="echoStringSoapOut">
        <part name="return" type="s:string"/>
    </message>
    <portType name="SimpleTestSoap">
        <operation name="echoString">
            <input message="s1:echoStringSoapIn"/>
            <output message="s1:echoStringSoapOut"/>
        </operation>
    </portType>
    <binding name="SimpleTestSoap" type="s1:SimpleTestSoap">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="echoString">
            <soap:operation soapAction="http://soapinterop.org/" style="rpc"/>
            <input>
                <soap:body
                    encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                    namespace="http://soapinterop.org/"
                    use="encoded"/>
            </input>
            <output>
                <soap:body
                    encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                    namespace="http://soapinterop.org/"
                    use="encoded"/>
            </output>
        </operation>
    </binding>
    <service name="SimpleTest">
        <documentation>These operations implement some simple Section 5, rpc-style SOAP operations, for interop testing. Please email keithba@microsoft.com with any  questions.</documentation>
        <port binding="s1:SimpleTestSoap" name="SimpleTestSoap">
            <soap:address location="http://royalesoap2.rnd.newton.allairecorp.com:81/asmx/simple.asmx"/>
        </port>
    </service>
</definitions>