interop-mock/src/main/resources/whitemesa/soap12/add-test-rpc/XMLP-9-request.xml

<?xml version="1.0" ?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" 
              xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Body>
    <sb:echoString xmlns:sb="http://soapinterop.org/">
      <inputString env:encodingStyle="http://this-is-a-bad-encoding-style">${inputString}</inputString>
    </sb:echoString>
  </env:Body>
</env:Envelope>
