interop-mock/src/main/resources/whitemesa/XMLP-15-request.xml

<?xml version="1.0" ?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" 
              xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Header>
    <ns:unknown xmlns:ns="http://test-xmlp-15" env:role="http://www.w3.org/2003/05/soap-envelope/role/next" xsi:type="xsd:string">${headerContent}</ns:unknown>
  </env:Header>
  <env:Body>
    <sb:echoString xmlns:sb="http://soapinterop.org/">
      <inputString xsi:type="xsd:string">${inputString}</inputString>
    </sb:echoString>
  </env:Body>
</env:Envelope>
